
#Область СлужебныеПроцедурыИФункции


Процедура ВКМ_ОтправкаУведомлений() Экспорт
ТокенTG = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
АдресTelegramAPI = "api.telegram.org";
Chat_id = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();

Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
|	ВКМ_УведомленияТелеграмБотуДляОтправки.Ссылка,
|	ВКМ_УведомленияТелеграмБотуДляОтправки.ТекстСообщения
|ИЗ
|	Справочник.ВКМ_УведомленияТелеграмБотуДляОтправки КАК ВКМ_УведомленияТелеграмБотуДляОтправки";

Выборка = Запрос.Выполнить().Выбрать();
Пока Выборка.Следующий() Цикл
	
	ТекстСообщения = Выборка.ТекстСообщения;
	
	СоединениеHTTP = Новый HTTPСоединение(АдресTelegramAPI,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());

	Данные = Новый Структура;
	Данные.Вставить("text", ТекстСообщения);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	СтрокаJSON = ЗаписьJSON.Закрыть();

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	
	АдресЗапроса = "/bot" + ТокенTG + "/sendMessage?chat_id=" + Формат(Chat_id, "ЧГ=");
	ЗапросHTTP = Новый HTTPЗапрос(АдресЗапроса, Заголовки);
	ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаJSON);

	Попытка
		Результат = СоединениеHTTP.ОтправитьДляОбработки(ЗапросHTTP);	
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.Удалить();  
	Исключение
	   ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"),
	   УровеньЖурналаРегистрации.Ошибка,,,ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

	Если Не Результат.КодСостояния = 200 Тогда
		ВызватьИсключение "Ошибка проверки связи";	
	КонецЕсли;	
КонецЦикла;
КонецПроцедуры
#КонецОбласти
