
&НаСервере
Процедура ПроверитьСоздатьРеализации(Параметры, АдресРезультата) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ДоговорыКонтрагентов.Организация КАК Организация
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО (РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка)
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И ДоговорыКонтрагентов.ДатаНачалаДействия <= &ДатаНачала
	|	И ДоговорыКонтрагентов.ДатаОкончанияДействия >= &ДатаОкончания";
	Запрос.УстановитьПараметр("ДатаНачала", Параметры.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", НачалоДня(Параметры.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("ВидДоговора",Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.Реализация) Тогда
			ДокРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			ДокРеализация.Дата = ТекущаяДата();
			ДокРеализация.Договор = Выборка.Договор;
			ДокРеализация.Контрагент = Выборка.Контрагент;
			ДокРеализация.Организация = Выборка.Организация;
			ДокРеализация.Ответственный = Пользователи.ТекущийПользователь();
			ДокРеализация.ВыполнитьАвтозаполнение();
			ДокРеализация.ПроверитьЗаполнение();
			ДокРеализация.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			Продолжить;
		КонецЕсли;	
	КонецЦИкла;	
КонецПроцедуры