
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ДатаПроведенияРаботДо = '00010101'; 
	ВремяНачалаРаботПланДо = '00010101080000';
	
	Если Не ЭтоНовый() Тогда 
		Запрос = Новый Запрос; 
		Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРаботПлан,
		|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиента.Специалист
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка"; 

		Запрос.УстановитьПараметр("Ссылка", Ссылка); 

		Результат = Запрос.Выполнить(); 
		Выборка = Результат.Выбрать(); 
		
		Если Выборка.Следующий() Тогда 
			ДатаПроведенияРаботДо = Выборка.ДатаПроведенияРабот;
			ВремяНачалаРаботПланДо = Выборка.ВремяНачалаРаботПлан;
			СпециалистДо = Выборка.Специалист; 
		КонецЕсли;
		
		МассивИзменений = Новый Массив;
		
		Если ДатаПроведенияРаботДо <> ДатаПроведенияРабот Тогда 
			МассивИзменений.Добавить("Дата: " + Формат(ДатаПроведенияРабот,"ДФ=dd.MM.yyyy;"));
		КонецЕсли;
		
		Если ВремяНачалаРаботПланДо <> ВремяНачалаРаботПлан Тогда 
			МассивИзменений.Добавить("Время: " + Формат(ВремяНачалаРаботПлан,"ДЛФ=T;"));
		КонецЕсли;
		
		Если СпециалистДо <> Специалист Тогда 
			МассивИзменений.Добавить("Специалист: " + Специалист);
		КонецЕсли;
		
		СообщениеТекст = СтрСоединить(МассивИзменений, ", ");
		
		ОбъектУведомления = Справочники.ВКМ_УведомленияТелеграмБотуДляОтправки.СоздатьЭлемент();
		ОбъектУведомления.ТекстСообщения = СообщениеТекст;
		ОбъектУведомления.Записать();
	Иначе	 
		ОбъектУведомления = Справочники.ВКМ_УведомленияТелеграмБотуДляОтправки.СоздатьЭлемент();
		ОбъектУведомления.ТекстСообщения = СтрШаблон("Специалист: %1, Дата: %2, Время: %3"
		, Специалист, ДатаПроведенияРабот, ВремяНачалаРаботПлан);
		ОбъектУведомления.Записать(); 
	КонецЕсли; 
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)
	Если Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание
	И Договор.ДатаНачалаДействия < Дата И Дата < Договор.ДатаОкончанияДействия Тогда
	
	// регистр ВКМ_ВыполненныеКлиентуРаботы
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Для Каждого ТекСтрокаВыполненныеРаботы из ВыполненныеРаботы Цикл
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = Договор.СтоимостьЧасаРабот * ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту;
	КонецЦикла;
	КонецЕсли;
КонецПроцедуры

