
&НаКлиенте
Процедура ОтпускаСотрудниковПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	РаскраситьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	ТекущиеДанные.ВсегоДнейОтпуска = (КонецДня(ТекущиеДанные.ДатаОкончания) - НачалоДня(ТекущиеДанные.ДатаНачала) - 86400) / 86400; 
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	ТекущиеДанные.ВсегоДнейОтпуска = (КонецДня(ТекущиеДанные.ДатаОкончания) - НачалоДня(ТекущиеДанные.ДатаНачала) - 86400) / 86400; 
КонецПроцедуры

&НаСервере
Процедура РаскраситьСтроку()

	ТЗ = Объект.ОтпускаСотрудников.Выгрузить(,"Сотрудник, ВсегоДнейОтпуска");
	ТЗ.Свернуть("Сотрудник", "ВсегоДнейОтпуска");
	Для Каждого Колонка Из ТЗ Цикл
		ПараметрыОтбора = Новый Структура("Сотрудник",Колонка.Сотрудник);
		НайденныеСтроки = Объект.ОтпускаСотрудников.НайтиСтроки(ПараметрыОтбора);
		Для Каждого Стр Из НайденныеСтроки Цикл
			Если Колонка.ВсегоДнейОтпуска > 28 Тогда
				Стр.Перебор = Истина;
			Иначе
				Стр.Перебор = Ложь;
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	
	Оформление = УсловноеОформление.Элементы.Добавить();
	Оформление.Использование = Истина;
	
	ПолеОформляемое1 = Оформление.Поля.Элементы.Добавить();
	ПолеОформляемое1.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковСотрудник");
	ПолеОформляемое2 = Оформление.Поля.Элементы.Добавить();
	ПолеОформляемое2.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковДатаНачала");
    ПолеОформляемое3 = Оформление.Поля.Элементы.Добавить();
	ПолеОформляемое3.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковДатаОкончания");
	
	Отбор = Оформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.Перебор");
	Отбор.ПравоеЗначение = Истина;
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование = Истина;
	
	Оформление.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЛиловый);
	
КонецПроцедуры	


&НаКлиенте
Процедура ОткрытьАнализГрафика(Команда)
	Адрес = ЗаписьДанныхДляДопФормы();
	ПараметрыФормы = Новый Структура("Адрес", Адрес);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, Элементы.ОтпускаСотрудников);
КонецПроцедуры

&НаСервере
Функция ЗаписьДанныхДляДопФормы()
	Возврат ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить(,"Сотрудник, ДатаНачала, ДатаОкончания"),УникальныйИдентификатор) 	
КонецФункции	
