&НаСервере
Процедура СозданиеАктовПоАбонентскимДоговорам(Параметры, АдресРезультата) Экспорт
	Для Каждого СтрАкты Из Акты Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачальная И &ДатаКонечная
		|	И РеализацияТоваровУслуг.Договор = &Договор";
		Запрос.УстановитьПараметр("ДатаНачальная", Параметры.Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаКонечная", Параметры.Период.ДатаОкончания);
		Запрос.УстановитьПараметр("Договор",СтрАкты.Договор);
		Выборка = Запрос.Выполнить.Выбрать();
		Если Выборка.Количество() = 0 Тогда
			ДокРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			//
			ДокРеализация.ВыполнитьАвтозаполнение();
			ДокРеализация.ПроверитьЗаполнение();
			ДокРеализация.Записать();
		Иначе
			Сообщить("В указанном периоде все реализации созданы");
			Возврат;
		КонецЕсли;		
	КонецЦикла;	
КонецПроцедуры	