
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СформироватьДвижения();	
	
	РассчитатьУдержания();
	
	// регистр ВКМ_ВзаиморасчетыССотрудниками 
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	Документ.ВКМ_НачислениеФиксированнойПремии.СписокСотрудников КАК ВКМ_НачислениеФиксированнойПремииСписокСотрудников
	               |ГДЕ
	               |	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Сотрудник";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Сумма = СуммаВКМ_ВзаиморасчетыССотрудниками(Выборка.Сотрудник);
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьДвижения();
	
	Для Каждого Строка Из СписокСотрудников Цикл
				
		Если ТипЗнч(Строка.ВидРасчета) = Тип ("ПланВидовРасчетаСсылка.ВКМ_ДополнительныеНачисления") Тогда
			
			Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
			Движение.ПериодРегистрации = Дата;
			Движение.ВидРасчета = Строка.ВидРасчета;
			Движение.Сотрудник = Строка.Сотрудник;
			Движение.Размер = Строка.СуммаПремии;
			
		КонецЕсли;
		
		Если ТипЗнч(Строка.ВидРасчета) = Тип ("ПланВидовРасчетаСсылка.ВКМ_Удержания") Тогда
			
			Движение = Движения.ВКМ_Удержания.Добавить();
			Движение.ПериодРегистрации = Дата;
			Движение.ВидРасчета = Строка.ВидРасчета;
			Движение.Сотрудник = Строка.Сотрудник;
			Движение.Размер = Строка.СуммаПремии;
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры

Процедура РассчитатьУдержания();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_Удержания.НомерСтроки КАК НомерСтроки,
	               |	ВКМ_Удержания.Размер КАК Размер
	               |ИЗ
	               |	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	               |ГДЕ
	               |	ВКМ_Удержания.Регистратор = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_Удержания[Выборка.НомерСтроки - 1];
		Движение.Размер = Окр(((Выборка.Размер / 100) * 13),2);
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать(,Истина);
		
КонецПроцедуры

Функция СуммаВКМ_ВзаиморасчетыССотрудниками(Сотрудник);
	Запрос = Новый Запрос;
	Запрос.Текст = "
				   |ВЫБРАТЬ
				   |	ВКМ_ДополнительныеНачисления.Размер КАК Размер
				   |ИЗ
				   |	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
				   |ГДЕ
				   |	ВКМ_ДополнительныеНачисления.Регистратор = &Регистратор
				   |	И ВКМ_ДополнительныеНачисления.Сотрудник = &Сотрудник
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВКМ_Удержания.Размер КАК Размер
	               |ИЗ
	               |	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
				   |ГДЕ
				   |	ВКМ_Удержания.Регистратор = &Регистратор
				   |	И ВКМ_Удержания.Сотрудник = &Сотрудник";
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ДополнительныеНачисления = РезультатЗапроса[0].Выгрузить();
	Удержания = РезультатЗапроса[1].Выгрузить();
	Размер = ДополнительныеНачисления[0].Размер - Удержания[0].Размер;
	Возврат Размер;
КонецФункции