
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Адрес = Параметры.Адрес;
	ОтпускаСотрудников.Загрузить(ПолучитьИзВременногоХранилища(Адрес));
	
	ДГ.Очистить();
	ДГ.Обновление = Ложь;
	
	Для Каждого Стр Из ОтпускаСотрудников Цикл
		
		ТочкаДГ = ДГ.УстановитьТочку(Стр.Сотрудник);
		ТочкаДГ.Текст = Стр.Сотрудник.Наименование; 
		СерияДГ = ДГ.УстановитьСерию("Отпуск");
		СерияДГ.Текст = "Отпуск";
		Значение = ДГ.ПолучитьЗначение(ТочкаДГ, СерияДГ);
		Интервал = Значение.Добавить();
		Интервал.Начало = Стр.ДатаНачала;
		Интервал.Конец = Стр.ДатаОкончания;
		Интервал.Текст = Формат(Строка(Стр.ДатаНачала),"ДФ=dd.MM.yyyy") + "-" + Формат(Строка(Стр.ДатаОкончания),"ДФ=dd.MM.yyyy");
	КонецЦикла;
	
	ДГ.Обновление = Истина;
КонецПроцедуры
