
&НаКлиенте
Процедура ЗаполнитьОклад(Команда)
	Начисления = Объект.Начисления;
	Для Каждого Стр Из Начисления Цикл
		Если Стр.ВидРасчета.Наименование = "Оклад" Тогда
			Оклад = ВернутьОклад(Стр.Сотрудник);
			Стр.Размер = Оклад;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

Функция ВернутьОклад(Сотрудник);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад
	               |ИЗ
	               |	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(, Сотрудник = &Сотрудник) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Оклад = Выборка.Оклад;	
	КонецЦикла;
	Возврат Оклад;
КонецФункции;	