
&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	//++ Начало доработки
	//Условие для отображения видимости
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание Тогда
		Элементы.ГруппаСрокДоговора.Видимость = Истина;
		Элементы.ГруппаСтоимостьДоговора.Видимость = Истина;
	Иначе
		Элементы.ГруппаСрокДоговора.Видимость = Ложь;
		Элементы.ГруппаСтоимостьДоговора.Видимость = Ложь;	
	КонецЕсли;
	//--КонецДоработки
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//++ Начало доработки
	//Группа1
	ГруппаСрокДоговора = ЭтаФорма.Элементы.Добавить("ГруппаСрокДоговора", Тип("ГруппаФормы"),ЭтаФорма);
	ГруппаСрокДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСрокДоговора.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаСрокДоговора.ОтображатьЗаголовок = ЛОЖЬ; 
	ГруппаСрокДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ДатаНачала", Тип("ПолеФормы"),ГруппаСрокДоговора);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ДатаНачалаДействия";
	НовыйЭлемент.Заголовок = "Дата начала действия";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ДатаОкончания", Тип("ПолеФормы"),ГруппаСрокДоговора);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ДатаОкончанияДействия";
	НовыйЭлемент.Заголовок = "Дата окончания действия";
	
	//Группа2
	ГруппаСтоимостьДоговора = ЭтаФорма.Элементы.Добавить("ГруппаСтоимостьДоговора", Тип("ГруппаФормы"),ЭтаФорма);
	ГруппаСтоимостьДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСтоимостьДоговора.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаСтоимостьДоговора.ОтображатьЗаголовок = ЛОЖЬ; 
	ГруппаСтоимостьДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("СтоимостьЧаса", Тип("ПолеФормы"),ГруппаСтоимостьДоговора);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.СтоимостьЧасаРабот";
	НовыйЭлемент.Заголовок = "Стоимость часа работ";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("СуммаАбонентской", Тип("ПолеФормы"),ГруппаСтоимостьДоговора);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.СуммаАбонентскойПлаты";
	НовыйЭлемент.Заголовок = "Сумма абонентской платы";
	
	//Условие для отображения видимости
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание Тогда
		Элементы.ГруппаСрокДоговора.Видимость = Истина;
		Элементы.ГруппаСтоимостьДоговора.Видимость = Истина;
	Иначе
		Элементы.ГруппаСрокДоговора.Видимость = Ложь;
		Элементы.ГруппаСтоимостьДоговора.Видимость = Ложь;	
	КонецЕсли;
	//--КонецДоработки
	
КонецПроцедуры
